# GetFacets Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..GetFacets Method
PolymeshTopology Class See Also
---
Returns a definitions of all facets of the polymesh
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<PolymeshFacet> GetFacets()
```

Visual Basic
---
```text
Public Function GetFacets As IList(Of PolymeshFacet)
```

Visual C++
---
```text
public:
IList<PolymeshFacet^>^ GetFacets()
```

# ### Return Value
An array of PolymeshFacet instances, each of which represents one facet defined by 3 vertices of the polymesh.
# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace